Repository: Chaine-de-Blocs/bitcoin-manim
Catalog: locales/*/LC_MESSAGES/*.po
Languages: fr

source: Processing the SCRIPT
fr: Traitement du SCRIPT

source: Finishing the SCRIPT
fr: Finalisation du SCRIPT

source: Output Stack (RESULT)
fr: Valeurs de sortie

source: This transaction fails because of {value}
fr: Cette transaction a échoué avec la valeur {value}

source: The Result is {result}. This transaction is valid!
fr: Le résultat est {result}. Cette transaction est valide !

source: The Result is {result}. This transaction fails!
fr: Le résultat est {result}. Cette transaction est invalide !

source: {op_code_name} : Are the values {value_1} and {value_2} equals?
fr: {op_code_name} : Est-ce que les valeurs {value_1} et {value_2} sont égales ?

source: {op_code_name} : Adds the values {value_1} and {value_2}
fr: {op_code_name} : Additionne les valeurs {value_1} et {value_2}

source: {op_code_name} : Substacts the values {value_1} and {value_2}
fr: {op_code_name} : Soustrait les valeurs {value_1} et {value_2}

source: {op_code_name} : Multiplies the values {value_1} and {value_2}
fr: {op_code_name} : Multiplie les valeurs {value_1} et {value_2}

source: {op_code_name} : Divides the values {value_1} and {value_2}
fr: {op_code_name} : Divise les valeurs {value_1} et {value_2}

source: {op_code_name} : Modulos the values {value_1} and {value_2}
fr: {op_code_name} : Divise les valeurs {value_1} et {value_2}, puis retourne le reste de la division

source: {op_code_name} : SHA256 Hashes the value {value_1}
fr: {op_code_name} : Hash la valeur {value_1} avec SHA256

source: {op_code_name} : RIPEMD160 Hashes the value {value_1}
fr: {op_code_name} : Hash la valeur {value_1} avec RIPEMD160

source: {op_code_name} : Duplicates the value {value_1}
fr: {op_code_name} : Duplique la valeur {value_1}

source: {op_code_name} : Removes the last output value {value_1}
fr: {op_code_name} : Supprime la dernière valeur {value_1}

source: {op_code_name} : Verifies if the last output value is {value_1}
fr: {op_code_name} : Vérifie que la derrnière valeur de sortie est {value_1}

source: {op_code_name} : Checks if {value_1} and {value_2} are equals. The transaction fails if they are not equals
fr: {op_code_name} : Contrôle si les valeurs {value_1} et {value_2} sont égales. La transaction échoue si elles ne sont pas égales

source: {op_code_name} : Checks the signature for message {value_1}
fr: {op_code_name} : Contrôle la signature ECDSA (secp256k1) pour le message {value_1}

source: {op_code_name} : Enters the IF block
fr: {op_code_name} : Entre dans la condition IF

source: {op_code_name} : Does not enter the IF block
fr: {op_code_name} : N'entre pas dans la condition IF

source: {op_code_name} : The current IF block ended
fr: {op_code_name} : Fin de la condition IF précédente

source: {op_code_name} : Automatically results in transaction fail
fr: {op_code_name} : Résulte automatiquement en échec de transaction

source: The value is empty or less than 0
fr: La valeur est vide ou inférieure à 0

source: The given expiry time {expire_time} is greater than nLockTime {lock_time}
fr: Le temps d'expiration {expire_time} est supérieur au nLockTime de {lock_time}

source: The given expiry time is greater than 500000000 but nLockTime is less than 500000000
fr: Le temps d'expiration fourni est plus grand que 500 000 000 mais le nLockTime est inférieur à 500 000 000

source: The nLockTime is greater than 500000000 but given expiry time is less than 500000000
fr: Le nLockTime est supérieur à 500 000 000 mais le temps d'expiration fourni est inférieur à 500 000 000

source: The nSequence is 0xFFFFFFFF
fr: Le nSequence est 0xFFFFFFFF

source: {op_code_name} : Check lock time for value {value_1}, nLockTime of the transaction is {n_lock_time}
fr: {op_code_name} : Contrôle le lock time {value_1}, le nLockTime de la transaction est de {n_lock_time}

source: Reads the data {value_1} from input stack
fr: Lecture de la valeur {value_1} de l'input stack

source: Not handled OPCODE, got {p_opcode}, and input block {input_block}
fr: Cet OPCODE n'est pas connu, l'OPCODE reçu est {p_opcode}, et le bloc en Input est {input_block}

source: 0 or False
fr: 0 ou False

source: 1 or True
fr: 1 ou True

source: {op_code_name} : Pushes the value {value_1}
fr: {op_code_name} : Ajoute la valeur {value_1}

source: {op_code_name} params
fr: Paramètre de {op_code_name}
